{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# MODAL 473G\n",
    "_Gaëtan Ecrepont, Ilyas Glaib_"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# useful libraries for manipulating and visualizing the data\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np\n",
    "import pandas as pd"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3. Graph construction\n",
    "\n",
    "### 3.1 Querying Wikidata\n",
    "Compute the number of distinct mathematicians:\n",
    "<pre style=\"font-family: monospace\">\n",
    "SELECT (COUNT(DISTINCT(?mathematician)) as ?count)\n",
    "WHERE\n",
    "{\n",
    "  ?mathematician wdt:P106 wd:Q170790.\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "}\n",
    "</pre>\n",
    "Output : 37324\n",
    "<br>\n",
    "<hr>\n",
    "<br>\n",
    "Compute the number of distinct mathematicians with attributes dob, dod, university, field of work and country:\n",
    "<pre style=\"font-family: monospace\">\n",
    "SELECT (COUNT(DISTINCT(?mathematician)) as ?count)\n",
    "WHERE<\n",
    "{\n",
    "  ?mathematician wdt:P106 wd:Q170790;\n",
    "                 wdt:P69 ?university;\n",
    "                 wdt:P569 ?dob;\n",
    "                 wdt:P570 ?dod;\n",
    "                 wdt:P101 ?fieldOfWork;\n",
    "                 wdt:P27 ?country.\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "}\n",
    "</pre>\n",
    "Output : 3768\n",
    "<br>\n",
    "<hr>\n",
    "<br>\n",
    "Retrieve all mathematicians with attributes dob, dod, university, field of work and country and optional attribute doctoral students:\n",
    "<pre style=\"font-family: monospace\">\n",
    "SELECT ?mathematicianLabel ?universityLabel ?dob ?dod ?fieldOfWorkLabel ?countryLabel ?doctoralStudentLabel\n",
    "WHERE \n",
    "{\n",
    "  ?mathematician wdt:P106 wd:Q170790;\n",
    "                 wdt:P69 ?university;\n",
    "                 wdt:P569 ?dob;\n",
    "                 wdt:P570 ?dod;\n",
    "                 wdt:P101 ?fieldOfWork;\n",
    "                 wdt:P27 ?country.\n",
    "  OPTIONAL { ?mathematician wdt:P185 ?doctoralStudent. }\n",
    "                  \n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "}\n",
    "</pre>\n",
    "Output : our main CSV file with over 200,000 rows."
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3.2 Preprocessing the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Our main CSV file has 207926 rows and 7 columns.\n",
      "Here is a preview of the data frame:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mathematicianLabel</th>\n",
       "      <th>universityLabel</th>\n",
       "      <th>dob</th>\n",
       "      <th>dod</th>\n",
       "      <th>fieldOfWorkLabel</th>\n",
       "      <th>countryLabel</th>\n",
       "      <th>doctoralStudentLabel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>52169</th>\n",
       "      <td>Dmitri Egorov</td>\n",
       "      <td>Moscow State University</td>\n",
       "      <td>1869-12-22T00:00:00Z</td>\n",
       "      <td>1931-09-10T00:00:00Z</td>\n",
       "      <td>calculus of variations</td>\n",
       "      <td>Russian Socialist Federative Soviet Republic</td>\n",
       "      <td>Ivan Privalov</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48565</th>\n",
       "      <td>Rolf Nevanlinna</td>\n",
       "      <td>Helsingin Suomalainen Yhteiskoulu</td>\n",
       "      <td>1895-10-22T00:00:00Z</td>\n",
       "      <td>1980-05-28T00:00:00Z</td>\n",
       "      <td>complex analysis</td>\n",
       "      <td>Finland</td>\n",
       "      <td>Inkeri Simola</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39430</th>\n",
       "      <td>John Edensor Littlewood</td>\n",
       "      <td>Trinity College</td>\n",
       "      <td>1885-06-09T00:00:00Z</td>\n",
       "      <td>1977-09-06T00:00:00Z</td>\n",
       "      <td>mathematics</td>\n",
       "      <td>United Kingdom</td>\n",
       "      <td>R. Cooper</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>165013</th>\n",
       "      <td>Ernest Vinberg</td>\n",
       "      <td>Moscow State University</td>\n",
       "      <td>1937-07-26T00:00:00Z</td>\n",
       "      <td>2020-05-12T00:00:00Z</td>\n",
       "      <td>algebra</td>\n",
       "      <td>Russia</td>\n",
       "      <td>Alexander Vladimirovich Smirnov</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29417</th>\n",
       "      <td>Nikolai Chebotaryov</td>\n",
       "      <td>3 Shevchenka Street, Kropyvnytskyi</td>\n",
       "      <td>1894-03-15T00:00:00Z</td>\n",
       "      <td>1947-07-02T00:00:00Z</td>\n",
       "      <td>number theory</td>\n",
       "      <td>Russian Empire</td>\n",
       "      <td>Wladimir Wladimirowitsch Morosow</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             mathematicianLabel                     universityLabel  \\\n",
       "52169             Dmitri Egorov             Moscow State University   \n",
       "48565           Rolf Nevanlinna   Helsingin Suomalainen Yhteiskoulu   \n",
       "39430   John Edensor Littlewood                     Trinity College   \n",
       "165013           Ernest Vinberg             Moscow State University   \n",
       "29417       Nikolai Chebotaryov  3 Shevchenka Street, Kropyvnytskyi   \n",
       "\n",
       "                         dob                   dod        fieldOfWorkLabel  \\\n",
       "52169   1869-12-22T00:00:00Z  1931-09-10T00:00:00Z  calculus of variations   \n",
       "48565   1895-10-22T00:00:00Z  1980-05-28T00:00:00Z        complex analysis   \n",
       "39430   1885-06-09T00:00:00Z  1977-09-06T00:00:00Z             mathematics   \n",
       "165013  1937-07-26T00:00:00Z  2020-05-12T00:00:00Z                 algebra   \n",
       "29417   1894-03-15T00:00:00Z  1947-07-02T00:00:00Z           number theory   \n",
       "\n",
       "                                        countryLabel  \\\n",
       "52169   Russian Socialist Federative Soviet Republic   \n",
       "48565                                        Finland   \n",
       "39430                                 United Kingdom   \n",
       "165013                                        Russia   \n",
       "29417                                 Russian Empire   \n",
       "\n",
       "                    doctoralStudentLabel  \n",
       "52169                      Ivan Privalov  \n",
       "48565                      Inkeri Simola  \n",
       "39430                          R. Cooper  \n",
       "165013   Alexander Vladimirovich Smirnov  \n",
       "29417   Wladimir Wladimirowitsch Morosow  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(\"../data/raw.csv\")\n",
    "print(f\"Our main CSV file has {df.shape[0]} rows and {df.shape[1]} columns.\")\n",
    "print(\"Here is a preview of the data frame:\")\n",
    "df.sample(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "After cleaning, our data frame looks like the following:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>mathematician</th>\n",
       "      <th>university</th>\n",
       "      <th>dob</th>\n",
       "      <th>dod</th>\n",
       "      <th>fieldOfWork</th>\n",
       "      <th>country</th>\n",
       "      <th>doctoralStudent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>58498</th>\n",
       "      <td>Kazimierz Kuratowski</td>\n",
       "      <td>University of Warsaw</td>\n",
       "      <td>1896</td>\n",
       "      <td>1980</td>\n",
       "      <td>topology</td>\n",
       "      <td>Poland</td>\n",
       "      <td>Stanislaw Mrowka</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32275</th>\n",
       "      <td>Nikolai Chebotaryov</td>\n",
       "      <td>Kamianets-Podilskyi Boys Gymnasium</td>\n",
       "      <td>1894</td>\n",
       "      <td>1947</td>\n",
       "      <td>function theory</td>\n",
       "      <td>Russian Empire</td>\n",
       "      <td>Aleksandr Yakovlevich Povzner</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20428</th>\n",
       "      <td>George Pólya</td>\n",
       "      <td>Eötvös Loránd University</td>\n",
       "      <td>1887</td>\n",
       "      <td>1985</td>\n",
       "      <td>education</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>Florian Eggenberger</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>200301</th>\n",
       "      <td>Robert V. Hogg</td>\n",
       "      <td>University of Iowa</td>\n",
       "      <td>1924</td>\n",
       "      <td>2014</td>\n",
       "      <td>statistics</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>Elliot Alan Tanis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81523</th>\n",
       "      <td>Ivan Vidav</td>\n",
       "      <td>University of Ljubljana</td>\n",
       "      <td>1918</td>\n",
       "      <td>2015</td>\n",
       "      <td>algebra</td>\n",
       "      <td>Slovenia</td>\n",
       "      <td>Jože Grasselli</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               mathematician                          university   dob   dod  \\\n",
       "58498   Kazimierz Kuratowski                University of Warsaw  1896  1980   \n",
       "32275    Nikolai Chebotaryov  Kamianets-Podilskyi Boys Gymnasium  1894  1947   \n",
       "20428           George Pólya            Eötvös Loránd University  1887  1985   \n",
       "200301        Robert V. Hogg                  University of Iowa  1924  2014   \n",
       "81523             Ivan Vidav             University of Ljubljana  1918  2015   \n",
       "\n",
       "            fieldOfWork                   country  \\\n",
       "58498          topology                    Poland   \n",
       "32275   function theory            Russian Empire   \n",
       "20428         education  United States of America   \n",
       "200301       statistics  United States of America   \n",
       "81523           algebra                  Slovenia   \n",
       "\n",
       "                      doctoralStudent  \n",
       "58498                Stanislaw Mrowka  \n",
       "32275   Aleksandr Yakovlevich Povzner  \n",
       "20428             Florian Eggenberger  \n",
       "200301              Elliot Alan Tanis  \n",
       "81523                  Jože Grasselli  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.columns = [str.replace(col, \"Label\", \"\") for col in df.columns] # cleaner names\n",
    "df = df.drop(index=[61005, 110655]) # remove two mathematicians with no death date, causing errors in the the code below\n",
    "df[\"dob\"] = df[\"dob\"].apply(lambda s: int(s[:4])) # only keep year\n",
    "df[\"dod\"] = df[\"dod\"].apply(lambda s: int(s[:4])) # only keep year\n",
    "\n",
    "print(\"After cleaning, our data frame looks like the following:\")\n",
    "df.sample(5)\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3.3 Quick exploration of the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 3753 mathematicians in the dataset.\n",
      "There are 902 fields of work in the dataset.\n",
      "There are 1309 universities in the dataset.\n",
      "There are 184 countries in the dataset.\n",
      "There are 22033 doctoral students in the dataset.\n",
      "There are 1866 doctoral students who are also in our mathematicians list.\n"
     ]
    }
   ],
   "source": [
    "mathematicians = df[\"mathematician\"].drop_duplicates()\n",
    "print(f\"There are {mathematicians.count()} mathematicians in the dataset.\")\n",
    "\n",
    "fow = df[\"fieldOfWork\"].drop_duplicates()\n",
    "print(f\"There are {fow.count()} fields of work in the dataset.\")\n",
    "\n",
    "universities = df[\"university\"].drop_duplicates()\n",
    "print(f\"There are {universities.count()} universities in the dataset.\")\n",
    "\n",
    "countries = df[\"country\"].drop_duplicates()\n",
    "print(f\"There are {countries.count()} countries in the dataset.\")\n",
    "\n",
    "doctoralStudents = df[\"doctoralStudent\"].drop_duplicates()\n",
    "print(f\"There are {doctoralStudents.count()} doctoral students in the dataset.\")\n",
    "# intersection between mathematicians and doctoral students\n",
    "print(f\"There are {doctoralStudents[doctoralStudents.isin(mathematicians)].count()} doctoral students who are also in our mathematicians list.\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3.4 The issue of mathematicians with several dob/dod"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of distinct (mathematician, dob) rows: 3769\n",
      "Number of distinct mathematicians: 3753\n"
     ]
    }
   ],
   "source": [
    "n1 = len(df[[\"mathematician\", \"dob\"]].drop_duplicates())\n",
    "print(f\"Number of distinct (mathematician, dob) rows: {n1}\")\n",
    "n2 = len(df[[\"mathematician\"]].drop_duplicates())\n",
    "print(f\"Number of distinct mathematicians: {n2}\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Thus, some mathematicians have several dob! Who are they?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 15 mathematicians with several dob.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>dob</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mathematician</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Adam Freytag</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Edward Waring</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Eugen Netto</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>J. N. Srivastava</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Jeremiah Horrocks</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Johannes Stabius</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Joseph Raphson</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Korneliy Karastelev</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Lee Stiff</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Mabel Gweneth Humphreys</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Mikhail Lavrentyev</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Paul Heinrich Fuss</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Robert Recorde</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Sergey Rossinskiy</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Wiktor Eckhaus</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         dob\n",
       "mathematician               \n",
       "Adam Freytag               2\n",
       "Edward Waring              2\n",
       "Eugen Netto                2\n",
       "J. N. Srivastava           2\n",
       "Jeremiah Horrocks          2\n",
       "Johannes Stabius           3\n",
       "Joseph Raphson             2\n",
       "Korneliy Karastelev        2\n",
       "Lee Stiff                  2\n",
       "Mabel Gweneth Humphreys    2\n",
       "Mikhail Lavrentyev         2\n",
       "Paul Heinrich Fuss         2\n",
       "Robert Recorde             2\n",
       "Sergey Rossinskiy          2\n",
       "Wiktor Eckhaus             2"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "_df = df[[\"mathematician\", \"dob\"]].drop_duplicates()\n",
    "_df = _df.groupby(\"mathematician\").count()\n",
    "several_dob = _df[_df[\"dob\"] > 1]\n",
    "print(f\"There are {len(several_dob)} mathematicians with several dob.\")\n",
    "several_dob"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The same goes for dod!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 10 mathematicians with several dod.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>dod</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>mathematician</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Adam Freytag</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Christoph Rudolff</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Dmitry Raikov</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Johannes de Sacrobosco</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Joseph Raphson</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Karel Hruša</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Mathukumalli V. Subbarao</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Mikhail Lavrentyev</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Roger Bacon</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Truman Lee Kelley</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                          dod\n",
       "mathematician                \n",
       "Adam Freytag                2\n",
       "Christoph Rudolff           2\n",
       "Dmitry Raikov               2\n",
       "Johannes de Sacrobosco      2\n",
       "Joseph Raphson              2\n",
       "Karel Hruša                 2\n",
       "Mathukumalli V. Subbarao    2\n",
       "Mikhail Lavrentyev          2\n",
       "Roger Bacon                 2\n",
       "Truman Lee Kelley           2"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "_df = df[[\"mathematician\", \"dod\"]].drop_duplicates()\n",
    "_df = _df.groupby(\"mathematician\").count()\n",
    "several_dod = _df[_df[\"dod\"] > 1]\n",
    "print(f\"There are {len(several_dod)} mathematicians with several dod.\")\n",
    "several_dod"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's get rid of the extra rows by keeping only the lowest dob/dod (this is an arbitrary choice but doesn't have much impact since the uncertainty is always plus or minus one year)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "_df = df.groupby(\"mathematician\").nunique()\n",
    "names = _df[_df[\"dob\"]>1].index\n",
    "\n",
    "for name in names:\n",
    "    dobs = df[df[\"mathematician\"]==name][\"dob\"].drop_duplicates().to_list()\n",
    "    df = df[~((df[\"mathematician\"]==name) & (df[\"dob\"].isin(dobs[1:])))]\n",
    "\n",
    "_df = df.groupby(\"mathematician\").nunique()\n",
    "names = _df[_df[\"dod\"]>1].index\n",
    "\n",
    "for name in names:\n",
    "    dods = df[df[\"mathematician\"]==name][\"dod\"].drop_duplicates().to_list()\n",
    "    df = df[~((df[\"mathematician\"]==name) & (df[\"dod\"].isin(dods[1:])))]"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's check!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are now 0 mathematicians with several dob.\n",
      "There are now 0 mathematicians with several dod.\n"
     ]
    }
   ],
   "source": [
    "_df = df[[\"mathematician\", \"dob\"]].drop_duplicates()\n",
    "_df = _df.groupby(\"mathematician\").count()\n",
    "several_dob = _df[_df[\"dob\"] > 1]\n",
    "print(f\"There are now {len(several_dob)} mathematicians with several dob.\")\n",
    "\n",
    "_df = df[[\"mathematician\", \"dod\"]].drop_duplicates()\n",
    "_df = _df.groupby(\"mathematician\").count()\n",
    "several_dod = _df[_df[\"dod\"] > 1]\n",
    "print(f\"There are now {len(several_dod)} mathematicians with several dod.\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's save this clean version of the data!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv(\"../data/main.csv\", index=False)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3.5 Building the graph using Neo4j\n",
    "\n",
    "#### 1. Building the nodes\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# CSV with all mathematicians and their dates of birth and death\n",
    "df[[\"mathematician\", \"dob\", \"dod\"]].drop_duplicates().to_csv(\"../data/nodes/mathematicians_dates.csv\", index=False)\n",
    "\n",
    "# for each attribute university, fieldOfWork, country, we create a CSV file with one row for each value of the attribute, as well as the number of mathematicians with this value\n",
    "for colname in [\"university\", \"fieldOfWork\", \"country\"]:\n",
    "    c = df.groupby(colname)[\"mathematician\"].nunique().sort_values(ascending=False)\n",
    "    c = c.rename_axis(colname).reset_index(name=\"count\")\n",
    "    c.to_csv(f\"../data/nodes/{colname}Count.csv\", index=False)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can now load this data into Neo4j and create our 4 types of node. using the following CYPHER queries:\n",
    "\n",
    "<pre style=\"font-family: monospace\">\n",
    "LOAD CSV WITH HEADERS FROM \"file:///nodes/mathematicians_dates.csv\" AS row\n",
    "CREATE (:Mathematician {name:row.mathematician, dob:toInteger(row.dob), dod:toInteger(row.dod)})\n",
    "\n",
    "LOAD CSV WITH HEADERS FROM \"file:///nodes/universityCount.csv\" AS row\n",
    "CREATE (:University {name:row.university})\n",
    "\n",
    "LOAD CSV WITH HEADERS FROM \"file:///nodes/fieldOfWorkCount.csv\" AS row\n",
    "CREATE (:FOW {name:row.fieldOfWork})\n",
    "\n",
    "LOAD CSV WITH HEADERS FROM \"file:///nodes/countryCount.csv\" AS row\n",
    "CREATE (:Country {name:row.country})\n",
    "</pre>"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Building the edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# for each type of relationship source->target, we project our main CSV file onto the two corresponding columns, drop duplicates, and save the result as a CSV file\n",
    "df[[\"mathematician\", \"university\"]].drop_duplicates().to_csv(\"../data/edges/mathematicians_universities.csv\", index=False)\n",
    "df[[\"mathematician\", \"doctoralStudent\"]].drop_duplicates().to_csv(\"../data/edges/mathematicians_doctoralStudents.csv\", index=False)\n",
    "df[[\"mathematician\", \"fieldOfWork\"]].drop_duplicates().to_csv(\"../data/edges/mathematicians_fow.csv\", index=False)\n",
    "df[[\"mathematician\", \"country\"]].drop_duplicates().to_csv(\"../data/edges/mathematicians_countries.csv\", index=False)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can now load this data into Neo4j and create our 3 first relationships (STUDIED_AT, DOCTORAL_ADVISOR_OF and HOME_COUNTRY) using the following CYPHER queries:"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<pre style=\"font-family: monospace\">\n",
    "LOAD CSV WITH HEADERS FROM \"file:///edges/mathematicians_universities.csv\" AS row\n",
    "MATCH (m:Mathematician), (u:University)\n",
    "WHERE m.name=row.mathematician AND u.name=row.university\n",
    "CREATE (m)-[:STUDIED_AT]->(u)\n",
    "\n",
    "LOAD CSV WITH HEADERS FROM \"file:///edges/mathematicians_doctoralStudents.csv\" AS row\n",
    "MATCH (m:Mathematician), (student:Mathematician)\n",
    "WHERE m.name=row.mathematician AND student.name=row.doctoralStudent\n",
    "CREATE (m)-[:DOCTORAL_ADVISOR_OF]->(student)\n",
    "\n",
    "LOAD CSV WITH HEADERS FROM \"file:///edges/mathematicians_countries.csv\" AS row\n",
    "MATCH (m:Mathematician), (c:Country)\n",
    "WHERE m.name=row.mathematician AND c.name=row.country\n",
    "CREATE (m)-[:HOME_COUNTRY]->(c)\n",
    "</pre>"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Complementing our graph using Wikipedia's data\n",
    "\n",
    "For the code, see the separate Python files.\n",
    "\n",
    "The two outputs that we are interested in are\n",
    "- edges_mathematicians.csv which links every mathematicians to the mathematical theories he has contributed to\n",
    "- theory_theory.csv which links every theory to its parent theories"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Target</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Carl Friedrich Gauss</td>\n",
       "      <td>abstract algebra</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Carl Friedrich Gauss</td>\n",
       "      <td>algebra</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carl Friedrich Gauss</td>\n",
       "      <td>algebraic number theory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Carl Friedrich Gauss</td>\n",
       "      <td>analysis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Carl Friedrich Gauss</td>\n",
       "      <td>arithmetic</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8273</th>\n",
       "      <td>Geneviève Raugel</td>\n",
       "      <td>perturbation theory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8274</th>\n",
       "      <td>Elizabeth Meckes</td>\n",
       "      <td>applied mathematics</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8275</th>\n",
       "      <td>Elizabeth Meckes</td>\n",
       "      <td>matrix theory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8276</th>\n",
       "      <td>Elizabeth Meckes</td>\n",
       "      <td>probability theory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8277</th>\n",
       "      <td>Elizabeth Meckes</td>\n",
       "      <td>statistics</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>8278 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                    Source                   Target\n",
       "0     Carl Friedrich Gauss         abstract algebra\n",
       "1     Carl Friedrich Gauss                  algebra\n",
       "2     Carl Friedrich Gauss  algebraic number theory\n",
       "3     Carl Friedrich Gauss                 analysis\n",
       "4     Carl Friedrich Gauss               arithmetic\n",
       "...                    ...                      ...\n",
       "8273      Geneviève Raugel      perturbation theory\n",
       "8274      Elizabeth Meckes      applied mathematics\n",
       "8275      Elizabeth Meckes            matrix theory\n",
       "8276      Elizabeth Meckes       probability theory\n",
       "8277      Elizabeth Meckes               statistics\n",
       "\n",
       "[8278 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "There are 2132 mathematicians and 294 theories in the dataset.\n"
     ]
    }
   ],
   "source": [
    "_df = pd.read_csv(\"../data/edges/edges_mathematicians.csv\")\n",
    "display(_df)\n",
    "n_mathematicians = _df[\"Source\"].nunique()\n",
    "n_theories = _df[\"Target\"].nunique()\n",
    "print(f\"There are {n_mathematicians} mathematicians and {n_theories} theories in the dataset.\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can now use this CSV file to create the CONTRIBUTED_TO relationship.\n",
    "\n",
    "<pre style=\"font-family: monospace\">\n",
    "LOAD CSV WITH HEADERS FROM \"file:///edges/edges_mathematicians.csv\" AS row\n",
    "MATCH (m:Mathematician), (t:Theory)\n",
    "WHERE m.name=row.Source AND t.name=row.Target\n",
    "CREATE (m)-[:CONTRIBUTED_TO]->(t)\n",
    "</pre>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Source</th>\n",
       "      <th>Target</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>absolute differential calculus</td>\n",
       "      <td>geometry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>absolute differential calculus</td>\n",
       "      <td>applied mathematics</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>absolute differential calculus</td>\n",
       "      <td>calculus</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>absolute differential calculus</td>\n",
       "      <td>differential geometry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>absolute differential calculus</td>\n",
       "      <td>linear algebra</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1654</th>\n",
       "      <td>wavelets</td>\n",
       "      <td>functional analysis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1655</th>\n",
       "      <td>wavelets</td>\n",
       "      <td>chaos theory</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1656</th>\n",
       "      <td>wavelets</td>\n",
       "      <td>computational mathematics</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1657</th>\n",
       "      <td>wavelets</td>\n",
       "      <td>fourier analysis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1658</th>\n",
       "      <td>wavelets</td>\n",
       "      <td>numerical analysis</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1659 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                              Source                     Target\n",
       "0     absolute differential calculus                   geometry\n",
       "1     absolute differential calculus        applied mathematics\n",
       "2     absolute differential calculus                   calculus\n",
       "3     absolute differential calculus      differential geometry\n",
       "4     absolute differential calculus             linear algebra\n",
       "...                              ...                        ...\n",
       "1654                        wavelets        functional analysis\n",
       "1655                        wavelets               chaos theory\n",
       "1656                        wavelets  computational mathematics\n",
       "1657                        wavelets           fourier analysis\n",
       "1658                        wavelets         numerical analysis\n",
       "\n",
       "[1659 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "_df = pd.read_csv(\"../data/edges/theory_theory.csv\", encoding=\"latin-1\") # encoding is in latin-1, because the Wikidata CSV was encoded in latin-1 as well, probably because Wikidata detected that our system is in French\n",
    "display(_df)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We can use this CSV to create our last relationship: SUBTHEORY_OF.\n",
    "<pre style=\"font-family: monospace\">\n",
    "LOAD CSV WITH HEADERS FROM \"file:///edges/theory_theory.csv\" AS row\n",
    "MATCH (t1:Theory), (t2:Theory)\n",
    "WHERE t1.name=row.Source AND t2.name=row.Target\n",
    "CREATE (t1)-[:SUBTHEORY_OF]->(t2)\n",
    "</pre>"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Our graph is now built!\n",
    "\n",
    "Here is a sample of what it looks like:\n",
    "\n",
    "<img src=\"../data/images/sample_graph.png\">"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And here is a graph that represents the structure of our graph.\n",
    "\n",
    "<img src=\"../data/images/graph_structure.png\">"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 4. Analysis and visualization  of the graph\n",
    "\n",
    "### 4.1 Querying the graph"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which 10 countries have the most mathematicians?\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician), (c:Country)\n",
    "WHERE (m)-[:HOME_COUNTRY]->(c)\n",
    "WITH COUNT(m) AS count, c.name as country\n",
    "ORDER BY count DESC\n",
    "LIMIT 10\n",
    "RETURN country, count\n",
    "pd.read_csv(\"../data/results/countries_most_mathematicians.csv\")\n",
    "</pre>\n",
    "Output : countries_most_mathematicians.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>country</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"United States of America\"</td>\n",
       "      <td>785</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"Soviet Union\"</td>\n",
       "      <td>706</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"Germany\"</td>\n",
       "      <td>389</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"Russian Empire\"</td>\n",
       "      <td>344</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"Russia\"</td>\n",
       "      <td>280</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>\"France\"</td>\n",
       "      <td>266</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>\"United Kingdom\"</td>\n",
       "      <td>259</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>\"Poland\"</td>\n",
       "      <td>137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>\"United Kingdom of Great Britain and Ireland\"</td>\n",
       "      <td>132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>\"Kingdom of Italy\"</td>\n",
       "      <td>116</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         country  count\n",
       "0                     \"United States of America\"    785\n",
       "1                                 \"Soviet Union\"    706\n",
       "2                                      \"Germany\"    389\n",
       "3                               \"Russian Empire\"    344\n",
       "4                                       \"Russia\"    280\n",
       "5                                       \"France\"    266\n",
       "6                               \"United Kingdom\"    259\n",
       "7                                       \"Poland\"    137\n",
       "8  \"United Kingdom of Great Britain and Ireland\"    132\n",
       "9                             \"Kingdom of Italy\"    116"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/results/countries_most_mathematicians.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which 10 universities have the most mathematicians?\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician), (u:University)\n",
    "WHERE (m)-[:STUDIED_AT]->(u)\n",
    "WITH COUNT(m) AS count, u.name as university\n",
    "ORDER BY count DESC\n",
    "LIMIT 10\n",
    "RETURN university, count\n",
    "</pre>\n",
    "Output : universities_most_mathematicians.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>university</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"Moscow State University\"</td>\n",
       "      <td>252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"University of Göttingen\"</td>\n",
       "      <td>210</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"MSU Faculty of Mechanics and Mathematics\"</td>\n",
       "      <td>180</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"University of Cambridge\"</td>\n",
       "      <td>171</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"Harvard University\"</td>\n",
       "      <td>135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>\"University of Paris\"</td>\n",
       "      <td>127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>\"Humboldt University of Berlin\"</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>\"Princeton University\"</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>\"École Normale Supérieure\"</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>\"Trinity College\"</td>\n",
       "      <td>89</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   university  count\n",
       "0                   \"Moscow State University\"    252\n",
       "1                   \"University of Göttingen\"    210\n",
       "2  \"MSU Faculty of Mechanics and Mathematics\"    180\n",
       "3                   \"University of Cambridge\"    171\n",
       "4                        \"Harvard University\"    135\n",
       "5                       \"University of Paris\"    127\n",
       "6             \"Humboldt University of Berlin\"    120\n",
       "7                      \"Princeton University\"    107\n",
       "8                  \"École Normale Supérieure\"    100\n",
       "9                           \"Trinity College\"     89"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/results/universities_most_mathematicians.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Interestingly, we find that most mathematicians live in the U.S., and yet top universities where future mathematicians get their education are mostly outside the U.S. We see that Russia, the U.K., Germany and France have more mathematics students than the U.S., yet less mathematicians.\n",
    "\n",
    "Maybe that is because the U.S. is more attractive to talented mathematicians: they get education in their birth country and then move to the U.S. to live there. Also, European universities had better reputation in the first half of the 20th century!\n",
    "\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician), (u:University)\n",
    "WHERE (m)-[:STUDIED_AT]->(u) AND m.dob<=1920\n",
    "WITH COUNT(m) AS count, u.name as university\n",
    "ORDER BY count DESC\n",
    "LIMIT 5\n",
    "RETURN university, count\n",
    "</pre>\n",
    "Output : top_universities_before_1920.csv\n",
    "\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician), (u:University)\n",
    "WHERE (m)-[:STUDIED_AT]->(u) AND m.dob>1920\n",
    "WITH COUNT(m) AS count, u.name as university\n",
    "ORDER BY count DESC\n",
    "LIMIT 5\n",
    "RETURN university, count\n",
    "</pre>\n",
    "Output : top_universities_after_1920.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Top universities before 1920:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>university</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"University of Göttingen\"</td>\n",
       "      <td>200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"University of Cambridge\"</td>\n",
       "      <td>116</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"Moscow State University\"</td>\n",
       "      <td>112</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"Humboldt University of Berlin\"</td>\n",
       "      <td>109</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"University of Paris\"</td>\n",
       "      <td>97</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>\"École Normale Supérieure\"</td>\n",
       "      <td>78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>\"Faculty of Physics and Mathematics of Moscow ...</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>\"University of Vienna\"</td>\n",
       "      <td>74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>\"Harvard University\"</td>\n",
       "      <td>73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>\"Trinity College\"</td>\n",
       "      <td>69</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          university  count\n",
       "0                          \"University of Göttingen\"    200\n",
       "1                          \"University of Cambridge\"    116\n",
       "2                          \"Moscow State University\"    112\n",
       "3                    \"Humboldt University of Berlin\"    109\n",
       "4                              \"University of Paris\"     97\n",
       "5                         \"École Normale Supérieure\"     78\n",
       "6  \"Faculty of Physics and Mathematics of Moscow ...     75\n",
       "7                             \"University of Vienna\"     74\n",
       "8                               \"Harvard University\"     73\n",
       "9                                  \"Trinity College\"     69"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Top universities after 1920:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>university</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"MSU Faculty of Mechanics and Mathematics\"</td>\n",
       "      <td>142</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"Moscow State University\"</td>\n",
       "      <td>137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"Harvard University\"</td>\n",
       "      <td>62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"Princeton University\"</td>\n",
       "      <td>58</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"University of Cambridge\"</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>\"Saint Petersburg State University\"</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>\"University of California, Berkeley\"</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>\"University of Chicago\"</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>\"Massachusetts Institute of Technology\"</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>\"University of Paris\"</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   university  count\n",
       "0  \"MSU Faculty of Mechanics and Mathematics\"    142\n",
       "1                   \"Moscow State University\"    137\n",
       "2                        \"Harvard University\"     62\n",
       "3                      \"Princeton University\"     58\n",
       "4                   \"University of Cambridge\"     49\n",
       "5         \"Saint Petersburg State University\"     36\n",
       "6        \"University of California, Berkeley\"     34\n",
       "7                     \"University of Chicago\"     33\n",
       "8     \"Massachusetts Institute of Technology\"     32\n",
       "9                       \"University of Paris\"     29"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "print(\"Top universities before 1920:\")\n",
    "display(pd.read_csv(\"../data/results/top_universities_before_1920.csv\"))\n",
    "print(\"Top universities after 1920:\")\n",
    "display(pd.read_csv(\"../data/results/top_universities_after_1920.csv\"))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We went from only 1 U.S. university in the top 10 before ~1950 to 5 after ~1950!\n",
    "\n",
    "This confirms our hypothesis that U.S. universities became more attractive in the 2nd half of the 20th century."
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which ten fields of mathematics (excluding \"mathematics\" itself) are most popular? (i.e. have the most mathematicians which contributed ot them)\n",
    "\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician), (f:FOW)\n",
    "WHERE (m)-[:CONTRIBUTED_TO]->(f) AND f.name<>\"mathematics\"\n",
    "WITH COUNT(m) AS count, f.name as fieldOfWork\n",
    "ORDER BY count DESC\n",
    "LIMIT 10\n",
    "RETURN fieldOfWork, count\n",
    "</pre>\n",
    "Output : fow_most_mathematicians.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>fieldOfWork</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"mathematical analysis\"</td>\n",
       "      <td>357</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"number theory\"</td>\n",
       "      <td>279</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"physics\"</td>\n",
       "      <td>234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"geometry\"</td>\n",
       "      <td>229</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"algebra\"</td>\n",
       "      <td>223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>\"topology\"</td>\n",
       "      <td>200</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>\"astronomy\"</td>\n",
       "      <td>187</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>\"theory of differential equations\"</td>\n",
       "      <td>184</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>\"probability theory\"</td>\n",
       "      <td>178</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>\"mechanics\"</td>\n",
       "      <td>151</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                          fieldOfWork  count\n",
       "0             \"mathematical analysis\"    357\n",
       "1                     \"number theory\"    279\n",
       "2                           \"physics\"    234\n",
       "3                          \"geometry\"    229\n",
       "4                           \"algebra\"    223\n",
       "5                          \"topology\"    200\n",
       "6                         \"astronomy\"    187\n",
       "7  \"theory of differential equations\"    184\n",
       "8                \"probability theory\"    178\n",
       "9                         \"mechanics\"    151"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/results/fow_most_mathematicians.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "As expected, we find large fields of mathematics like analysis, geometry, algebra, probability, etc. Interestingly, we also find non mathematicals domains such as physics, astronomy and mechanics. This shows that many mathematicians applied their skills to other fields of science."
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which ten mathematicians have had the most doctoral students?\n",
    "<pre font-family=\"monospace\">\n",
    "MATCH (da:Mathematician)-[:DOCTORAL_ADVISOR_OF]->(:Mathematician)\n",
    "WITH COUNT(da) AS count, da.name as name\n",
    "ORDER BY count DESC\n",
    "LIMIT 10\n",
    "RETURN name, count\n",
    "</pre>\n",
    "Output : top_doctoral_advisors.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"David Hilbert\"</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"Felix Klein\"</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"Ernst Kummer\"</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"Andrey Kolmogorov\"</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"Nikolai Luzin\"</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>\"Issai Schur\"</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>\"Karl Weierstraß\"</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>\"Charles Émile Picard\"</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>\"Pavel Aleksandrov\"</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>\"Rolf Nevanlinna\"</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                     name  count\n",
       "0         \"David Hilbert\"     26\n",
       "1           \"Felix Klein\"     25\n",
       "2          \"Ernst Kummer\"     20\n",
       "3     \"Andrey Kolmogorov\"     19\n",
       "4         \"Nikolai Luzin\"     17\n",
       "5           \"Issai Schur\"     16\n",
       "6       \"Karl Weierstraß\"     16\n",
       "7  \"Charles Émile Picard\"     15\n",
       "8     \"Pavel Aleksandrov\"     14\n",
       "9       \"Rolf Nevanlinna\"     14"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/results/top_doctoral_advisors.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which universities are best in probability theory?\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician)-[:STUDIED_AT]->(u:University)\n",
    "WHERE (m)-[:CONTRIBUTED_TO]->(:FOW {name:\"probability theory\"})\n",
    "WITH COUNT(m) AS count, u.name as university\n",
    "ORDER BY count DESC\n",
    "LIMIT 3\n",
    "RETURN university, count\n",
    "</pre>\n",
    "Output: top_universities_probability_theory.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>university</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"Moscow State University\"</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"Saint Petersburg State University\"</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"MSU Faculty of Mechanics and Mathematics\"</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   university  count\n",
       "0                   \"Moscow State University\"     24\n",
       "1         \"Saint Petersburg State University\"     13\n",
       "2  \"MSU Faculty of Mechanics and Mathematics\"     13"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/results/top_universities_probability_theory.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "All Russian, as expected!"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now, which universities are best in number theory?\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician)-[:STUDIED_AT]->(u:University)\n",
    "WHERE (m)-[:CONTRIBUTED_TO]->(:FOW {name:\"algebra\"})\n",
    "WITH COUNT(m) AS count, u.name as university\n",
    "ORDER BY count DESC\n",
    "LIMIT 3\n",
    "RETURN university, count\n",
    "</pre>\n",
    "Output: top_universities_number_theory.csv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>university</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"University of Göttingen\"</td>\n",
       "      <td>26</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"Humboldt University of Berlin\"</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"Moscow State University\"</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        university  count\n",
       "0        \"University of Göttingen\"     26\n",
       "1  \"Humboldt University of Berlin\"     20\n",
       "2        \"Moscow State University\"     19"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/results/top_universities_number_theory.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This time Germany is better! Note that Russian universities are leading the way on most theories though..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Carl Friedrich Gauss</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Gerardus Mercator</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Sophie Germain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Leonhard Euler</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Galileo Galilei</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2127</th>\n",
       "      <td>Anna Tramontano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2128</th>\n",
       "      <td>Emma Previato</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2129</th>\n",
       "      <td>Garnik Karapetyan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2130</th>\n",
       "      <td>Geneviève Raugel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2131</th>\n",
       "      <td>Elizabeth Meckes</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2132 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      Node\n",
       "0     Carl Friedrich Gauss\n",
       "1        Gerardus Mercator\n",
       "2           Sophie Germain\n",
       "3           Leonhard Euler\n",
       "4          Galileo Galilei\n",
       "...                    ...\n",
       "2127       Anna Tramontano\n",
       "2128         Emma Previato\n",
       "2129     Garnik Karapetyan\n",
       "2130      Geneviève Raugel\n",
       "2131      Elizabeth Meckes\n",
       "\n",
       "[2132 rows x 1 columns]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.read_csv(\"../data/nodes/nodes_mathematicians.csv\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 4.2 Using graph algorithms on projected graphs"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. The graph of mathematical theories and how they relate to each other\n",
    "We wanted to build a graph that would represent the interactions between mathematical subtheories. We were expecting to see some huge theories like algebra or analysis dominate and have many nodes pointing towards them through the SUBTHEORY_OF relationship, and these nodes would be intermediary theories, themselves pointed towards by even smaller theories, etc.\n",
    "\n",
    "#### First approach\n",
    "Our first approach was to simply take our CSV file containing the SUBTHEORY_OF (directed) edges and loading it straight up into Gephi.\n",
    "Note that our graph's family tree structure makes it unfit for certain graph algorithms, such as PageRank or betweenness centrality. We did attempt running these algorithms and obtained poor results as expected.\n",
    "\n",
    "Despite being quite basic in its construction, running modularity inference on our graph proved quite successful, as the visualization below showcase. However, it was not able to cluster theories into large domains like algebra and instead created smaller clusters, like computational mathematics. We thus have 63 communities and a modularity score of 0.477, which is average.\n",
    "\n",
    "Also, graph density is very low (0.008) and we have a few lone nodes, which correspond to niche mathematical theories such as systolic hyperbolic geometry, stratified morse theory, bolyai-lobachevskian geometry, etc.\n",
    "\n",
    "\n",
    "Here is a visualization using Force Atlas layout:\n",
    "\n",
    "<img src=\"../graphs/theory_theory_naive/force_atlas.png\">\n",
    "\n",
    "Here is another using Fruchterman Reingold layout:\n",
    "\n",
    "<img src=\"../graphs/theory_theory_naive/fruchterman_reingold.png\">\n",
    "\n",
    "#### Second approach\n",
    "We felt like this first approach was a bit naive and that we could do better. We thus created another graph, with the same Theory nodes but this time weighting the edges t1->t2 with the number of mathematicians who had contributed to both theories t1 and t2. We achieved this using the following CYPHER query:\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (t1:Theory), (t2:Theory), (m:Mathematician) WHERE (m)-[:CONTRIBUTED_TO]->(t1) AND (m)-[:CONTRIBUTED_TO]->(t2) AND t1.name<>t2.name RETURN t1.name AS Source, t2.name AS Target, COUNT(DISTINCT(m)) as Weight\n",
    "</pre>\n",
    "Output : theory_theory_2.csv\n",
    "\n",
    "We then loaded this CSV file into Gephi and this time the results were a lot more satisfying. Indeed, the modularity inference algorithm detected four classes only, which we identified as algebra, analysis, geometry and combinatorics, as shown below:\n",
    "\n",
    "<img src=\"../graphs/theory_theory_2/4_modularity_classes.png\">\n",
    "\n",
    "Overall modularity is 0.136, which is rather low as expected because mathematics are not clustered : all domains are linked one way or another. However we were quite surprised to find combinatorics along algebra, analysis and geometry, which are much larger domains. We thought it was some sort of algorithmical artifact and we tweaked the modularity algorithm slightly (using a resolution of 1.05 instead of 1) so as to end up with only 3 classes. This time combinatorics disappeared and we ended up with the algebra/analysis/geometry triad, as hoped!\n",
    "\n",
    "<img src=\"../graphs/theory_theory_2/3_modularity_classes.png\">"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. The graph of mathematicians and how they are linked to each other through the doctoral student/advisor relationship\n",
    "\n",
    "To build this graph, we only kept Mathematician nodes and we used directed edges. The edge m1->m2 means that m1 is a doctoral advisor of m2.\n",
    "\n",
    "The following CYPHER code does exactly this projection:\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH (m:Mathematician)-[:DOCTORAL_ADVISOR_OF]->(s:Mathematician) RETURN m.name as Source, s.name as Target\n",
    "</pre>\n",
    "Output : mathematician_mathematician.csv\n",
    "\n",
    "We can then load this CSV into Gephi to visualize our projected graph and run graph algorithms on it.\n",
    "\n",
    "Let's first visualize it using Yifan Hu layout.\n",
    "\n",
    "<img src=\"../graphs/mathematician_mathematician/modularity_classes.png\">"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We immediately see three interesting patterns:\n",
    "1. the modularity algorithm was able to cluster mathematicians into lineages where a mathematician's parent is its doctoral advisor\n",
    "2. it would appear that most lineages have common ancestors (corresponding to the large nodes in the center of the graph), meaning ancient mathematicians who's students became prominent mathematicians themselves, and so on\n",
    "3. some lineages (he ones on the borders of the circle) seem to be independent ; this could be due to a lack of data (i.e. we're missing some edges) or to the fact that some mathematical communities are most closed than others (e.g. the Japanese for a long time)\n",
    "\n",
    "The modularity score for the overall graph is 0.906, which is very high. This is coherent because as we've seen, mathematicians are clustered into lineages which don't interact much with each other.\n",
    "\n",
    "The community size distribution below demonstrates that most of the lineages are small (less than 10 mathematicians), although other lineages have over 50 members.\n",
    "\n",
    "<img src=\"../graphs/mathematician_mathematician/communities-size-distribution.png\">"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Another interesting metric with such a graph is eccentricity, which is defined as the distance from a given starting node to the farthest node from it in the network. Since edges are directional, a node's eccentricity is simply the length of its lineage, starting from itself. The eccentricity histogram below shows that most mathematicians have no doctoral students or just one. This is probably because few mathematicians actually have more than one doctoral student. However it's a bit surprising that most mathematicians have no doctoral students at all. Our hypothesis is that most do have one or more doctoral students, but they are not famous enough and therefore do not appear on the graph as they do not exist on Wikidata.\n",
    "\n",
    "<img src=\"../graphs/mathematician_mathematician/eccentricity.png\">\n",
    "\n",
    "Note that the graph diameter (defined as the longest path from one node to another) is 14. This is quite impressive, as it means that there is a lineage composed of 14 mathematicians. Let's take a look at it.\n",
    "\n",
    "We first retrieve the corresponding path using the following CYPHER command:\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH path=(:Mathematician)-[:DOCTORAL_ADVISOR_OF*14]->(:Mathematician) RETURN path\n",
    "</pre>\n",
    "\n",
    "Visualizing it directly in the Neo4j browser, we obtain the following:\n",
    "\n",
    "<img src=\"../graphs/mathematician_mathematician/longest_path.png\">\n",
    "\n",
    "We see that this lineage starts with Christian August Hausen, a German mathematician and physicist born in 1693, and ends in several leafs, including Marta Bunge, an Argentinian-Canadian mathematician who died last year, in 2022! We also see that some very famous mathematicians are actually \"grandparents\" of other very famous mathematicians through the doctoral student/advisor link. In that regard, Gauss is Felix Klein's great grandfather, and Klein himself is David Hilbert's grandfather!\n",
    "\n",
    "One additional question that comes to mind naturally is to determine the size of Christian August Hausen's lineage, i.e. the number of mathematicians who have him as their ancestor. We can figure this out quite simply using the following CYPHER query:\n",
    "<pre style=\"font-family: monospace\">\n",
    "MATCH path=(:Mathematician {name:\"Christian August Hausen\"})-[:DOCTORAL_ADVISOR_OF*1..]->(m:Mathematician) RETURN COUNT(DISTINCT(m))\n",
    "</pre>\n",
    "Output : 978\n",
    "\n",
    "In other words, over one quarter of the mathematicians in our graph have Christian August Hausen as their ancestor!"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Finally, if we look at the number of connected components, we find 112 separate connected components. The histogram belows confirms our intuition that there is one massive mathematical communityb with over 1600 nodes, and then a handful of much smaller, isolated lineages with no more than 50 nodes.\n",
    "\n",
    "<img src=\"../graphs/mathematician_mathematician/cc-size-distribution.png\">\n",
    "\n",
    "Also, note that again our graph's family tree structure makes it unfit for certain graph algorithms, such as PageRank or betweenness centrality. We did attempt running these algorithms and obtained poor results as expected."
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.4"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
